In [1]:
import pandas as pd 
import os

In [2]:
filepath_1 = os.path.join("..","Resources","player_salary.csv")

In [3]:
salary_df = pd.read_csv(filepath_1)

In [4]:
rename_salary = salary_df.rename(columns={"player_name":"PLAYER_NAME","salary":"SALARY"})
rename_salary

     Unnamed: 0          PLAYER_NAME         SALARY
0             0        Stephen Curry  $40,231,758
1             1           Chris Paul  $38,506,482
2             2    Russell Westbrook  $38,506,482
3             3         James Harden  $38,199,000
4             4         Kevin Durant  $38,199,000
..          ...                  ...            ...
467         472       Marques Bolden      $50,752
468         473           Tyler Cook      $50,752
469         475  Sir'Dominic Pointer      $50,752
470         476          Paul Watson      $50,752
471         477           Donta Hall      $50,752

[472 rows x 3 columns]

In [5]:
clean_salary_df = rename_salary.drop(columns=["Unnamed: 0"])

In [17]:
clean_salary_df['PLAYER_NAME'] = clean_salary_df['PLAYER_NAME'].str.replace('.','')
clean_salary_df

             PLAYER_NAME         SALARY
0          Stephen Curry  $40,231,758
1             Chris Paul  $38,506,482
2      Russell Westbrook  $38,506,482
3           James Harden  $38,199,000
4           Kevin Durant  $38,199,000
..                   ...            ...
467       Marques Bolden      $50,752
468           Tyler Cook      $50,752
469  Sir'Dominic Pointer      $50,752
470          Paul Watson      $50,752
471           Donta Hall      $50,752

[472 rows x 2 columns]

In [7]:
filepath_2 = os.path.join("..","Resources","players.csv")

In [19]:
player_df = pd.read_csv(filepath_2)
player_df['PLAYER_NAME'] = player_df['PLAYER_NAME'].str.replace('.','')
player_df

           PLAYER_NAME     TEAM_ID  PLAYER_ID  SEASON
0        Royce O'Neale  1610612762    1626220    2019
1     Bojan Bogdanovic  1610612762     202711    2019
2          Rudy Gobert  1610612762     203497    2019
3     Donovan Mitchell  1610612762    1628378    2019
4          Mike Conley  1610612762     201144    2019
...                ...         ...        ...     ...
7223       Lanny Smith  1610612758     201831    2009
7224     Warren Carter  1610612752     201999    2009
7225      Bennet Davis  1610612751     201834    2009
7226    Brian Hamilton  1610612751     201646    2009
7227   Wesley Matthews  1610612762     500032    2009

[7228 rows x 4 columns]

In [20]:
players = player_df.loc[player_df['SEASON'] == 2018]

In [21]:
players.drop_duplicates()

        PLAYER_NAME     TEAM_ID  PLAYER_ID  SEASON
626   Kawhi Leonard  1610612761     202695    2018
627   Pascal Siakam  1610612761    1627783    2018
628      Marc Gasol  1610612761     201188    2018
629     Danny Green  1610612761     201980    2018
630      Kyle Lowry  1610612761     200768    2018
...             ...         ...        ...     ...
1369  Tyrius Walker  1610612752    1629246    2018
1370     Marcus Lee  1610612748    1629159    2018
1371     Trey Lewis  1610612762    1629163    2018
1372  Emanuel Terry  1610612743    1629150    2018
1373   Justin Bibbs  1610612738    1629167    2018

[748 rows x 4 columns]

In [33]:
merge_salary_df = pd.merge(clean_salary_df, players, on="PLAYER_NAME", how = 'right')

In [34]:
cleaned_salary_df = merge_salary_df.drop_duplicates(subset=['PLAYER_NAME'])

In [35]:
cleaned_salary_df

           PLAYER_NAME         SALARY     TEAM_ID  PLAYER_ID  SEASON
0        Stephen Curry  $40,231,758    1610612744     201939    2018
1           Chris Paul  $38,506,482    1610612745     101108    2018
2    Russell Westbrook  $38,506,482    1610612760     201566    2018
3         James Harden  $38,199,000    1610612745     201935    2018
4         Kevin Durant  $38,199,000    1610612744     201142    2018
..                 ...            ...         ...        ...     ...
751       Cole Aldrich            NaN  1610612737     202332    2018
752      Tyrius Walker            NaN  1610612752    1629246    2018
753         Marcus Lee            NaN  1610612748    1629159    2018
754         Trey Lewis            NaN  1610612762    1629163    2018
755       Justin Bibbs            NaN  1610612738    1629167    2018

[627 rows x 5 columns]

In [14]:
cleaned_salary_df.to_csv("../outputs/salary_clean.csv", index=False)

In [26]:
clean_salary_df.loc[clean_salary_df.duplicated(), :]

Empty DataFrame
Columns: [PLAYER_NAME, SALARY]
Index: []